# -*- coding: utf-8 -*-

# 与音相关
#----------------------------------------------
# 列表前一个是音名，后一个是组别
range_low_c=['a',0]
range_high_c=['g',2] 
# -2重降，-1降，0无，1升，2重升
accidental_l=[0]


# 与调号相关
#----------------------------------------------
key_num_l=[1] # 调号数量
sharp_flat_l=['sharp'] # 升号调填sharp,降号调填flat
modal_l=[[['minor'],['harmony']],[['minor'],['harmony']]] # 前面填大调或小调，后面填写调式种类


# 与版面相关
#----------------------------------------------
# 选择谱号
clef='S' 
# ly文件生成
accidental_ly='@1'# ['all','@1','@12','@2','@0']  0是所有记号都有，1是没有重升重降，2是含有重升重降，3是只有重升重降，4是没有升降记号


space_l=[[2,'m'],[8,'p']]

list_num=10

midi_repeat=1